---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeVertexArray
source: html/ce947cf3-a5a8-43d7-49c7-3a1961ad7407.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray

An array that can contain any number of vertices used in Slab Shape Editing.

## Syntax (C#)
```csharp
public class SlabShapeVertexArray : APIObject,
	IEnumerable
```